#+SETUPFILE: ~/.emacs.d/org-templates/level-0.org
#+TITLE: 代码块

* Structure of Code Blocks
#+begin_verse
#+NAME: <name>
#+BEGIN_SRC <language> <switches> <header arguments>
<body>
#+END_SRC
#+end_verse

* Header Arguments
#+begin_verse
/Header Argument/ 以 :arg-name 的形式定义
有些预定义的 Header Argument,定义在变量 /org-babel-default-header-args/ 中,定义了如下值
:session => "none"
:results => replace
:exports => code
:cache => no
:noweb => no
#+end_verse
** 使用property来定义header-args
*** 在org文件的任意位置
#+begin_src org
  设置R语言在同一个session中
  ,#+PROPERTY: header-args:R :session *R*
  设置所有语言的results为silent
  ,#+PROPERTY: header-args :results silent
#+end_src
*** 在条目的drawers中设置
#+begin_src org
  ,* test0
    设置当前sub-tree的cache为yes
    :PROPERTIES:
    :header-args: :cache yes
    :END:

  ,* test1
    也可以为某个语言设置header-args
    :PROPERTIES:
    :header-args:Python: :session *Python*
    :END:
  ,** test11
     继承了test1的header-args
#+end_src
*** 在src block中设置heaer-args
#+begin_verse
src-block中的header-args拥有最高优先级
#+end_verse
#+begin_src python :results none
  print("1 + 1 = 2")
#+end_src

#+begin_verse
使用 =#+header: :var= 来定义变量,如data1,data2
也可以用 =:var= 来定义变量,data3,data4
#+end_verse

#+name: test
#+header: :var data1=1
#+header: :var data2=2
#+begin_src python :results output :var data3=3 data4=4
  print(data1, data2, data3, data4)
#+end_src

#+RESULTS:
: 1 2 3 4

#+begin_verse
使用call的时候传的参数,拥有最高优先级
#+end_verse
#+call: test(data1=10) :exports results

#+RESULTS:
: 10 2 3 4

* Variables

#+begin_verse
用 #+name 来定义变量
#+end_verse

#+name: host
http://test.shilai.zhiyi.cn

#+begin_src python :results output :var host=host
  print(host)
#+end_src

#+RESULTS:
: http://test.shilai.zhiyi.cn
:  [[1], [2]]

#+begin_src shell :results output :var host=host
  echo $host
#+end_src

#+RESULTS:
: http://test.shilai.zhiyi.cn
:
** 传递table变量

#+begin_verse
table变量传过去之后就是数组了,这里有两个特别重要的参数
=:colnames= : 是否有列名,当第一行下面有'-'时默认值为yes,处理这个table的时候将忽略这个头部
=:rownames= : 是否有行名,也就是第一列是不是表示列名,默认值为yes.
#+end_verse

#+name: table
| a | b | c | d | e |
|---+---+---+---+---|
| 1 | 2 | 3 | 4 | 5 |

#+begin_src python :results output :var table=table :colnames yes :rownames no
  print(table)
#+end_src

#+RESULTS:
: [[1, 2, 3, 4, 5]]
** 列表变量
#+name: ex_list
- simple
  - not
  - nested
- list

#+begin_verse
不适用于python
#+end_verse
#+begin_src python :results output :var ex_list=ex_list
  print(ex_list)
#+end_src

#+begin_src emacs-lisp :results output :var ex_list=ex_list
  (print ex_list)
#+end_src

#+RESULTS:
:
: (("simple" (unordered ("not") ("nested"))) ("list"))
** 传参
#+name: double
#+begin_src python :results output :var value=8
  print("double value = {}".format(value * value))
#+end_src

#+RESULTS: double
: double value = 64

#+begin_src python :results output :var double_default=double()
  print(double_default)
#+end_src

#+RESULTS:
: double value = 64
:

#+begin_src python :results output :var double_10=double(10)
  print(double_10)
#+end_src

#+RESULTS:
: double value = 100
:
** 字符串字面量
#+name: literal-example
#+begin_verse
A literal example
on two lines
#+end_verse

#+begin_src python :results output :var x=literal-example
  print(x)
#+end_src

#+RESULTS:
: A literal example
: on two lines
:

** variable indexing
#+begin_verse
当我们访问table的行,列的时候,是以原始的table来做的索引.colnames,rownames对索引没有任务影响
#+end_verse

#+name: example-table
| 1 | a |
|---+---|
| 2 | b |
| 3 | c |
| 4 | d |
| 5 | e |

#+begin_verse
使用','来访问多维表格
#+end_verse
#+begin_src python :results output :var value=example-table[0,-1]
  print(value)
#+end_src

#+RESULTS:
: a

#+begin_verse
使用':'来访问表格的连续的一段
#+end_verse
#+begin_src python :results output :var value=example-table[1:3]
  print(value)
#+end_src

#+RESULTS:
: [[2, 'b'], [3, 'c']]

#+begin_verse
返回某个维度的所有数据.把那个维度的值留空,或者使用'*',或者使用 0:-1
#+end_verse
#+begin_src python :results output :var value=example-table[,0]
  print(value)
#+end_src

#+RESULTS:
: [2, 3, 4, 5]

#+begin_src python :results output :var value=example-table[0:-1,0]
  print(value)
#+end_src

#+RESULTS:
: [2, 3, 4, 5]

#+begin_src python :results output :var value=example-table[*,0]
  print(value)
#+end_src

#+RESULTS:
: [2, 3, 4, 5]

* session
#+begin_verse
只有支持交互式的语言才支持session.像c这样的就不支持.
默认值为none,所有代码块处于不同的session.
有相同的session值的块被认为处于同一个session
如下,第一个块,需要先执行,后面的块才能知道有a这个值.如果a的值变了,需要重新执行一次
#+end_verse
#+begin_src python :session user
  a = 11
#+end_src

#+RESULTS:

#+begin_src python :session user :results output
  print(a)
#+end_src

#+RESULTS:
: 10
* working directory
#+begin_verse
使用 :dir 来定义代码块执行时的目录
#+end_verse

#+begin_src shell :dir ~/code
  ls -alh
#+end_src

#+RESULTS:
| total      | 56K |        |        |      |     |    |       |              |
| drwxrwxr-x |  14 | inmove | inmove | 4.0K | Oct | 22 | 21:42 | 0            |
| drwxr-xr-x |  31 | inmove | inmove | 4.0K | Nov |  1 | 10:57 | ..           |
| drwxrwxr-x |   9 | inmove | inmove | 4.0K | Nov |  1 | 11:36 | blog         |
| drwxrwxr-x |   4 | inmove | inmove | 4.0K | Sep |  5 | 19:51 | dotmap       |
| drwxrwxr-x |   5 | inmove | inmove | 4.0K | Sep | 29 | 23:20 | env          |
| drwxrwxr-x |   3 | inmove | inmove | 4.0K | Oct | 13 | 22:16 | hugo-test    |
| drwxrwxr-x |   4 | inmove | inmove | 4.0K | Aug | 17 | 23:35 | idates       |
| drwxrwxr-x |   2 | inmove | inmove | 4.0K | Jul | 23 | 23:51 | iesclient    |
| drwxrwxr-x |   6 | inmove | inmove | 4.0K | Jul | 16 | 23:45 | linux-dash   |
| drwxrwxr-x |   2 | inmove | inmove | 4.0K | Sep |  5 | 20:23 | lua          |
| drwxrwxr-x |   4 | inmove | inmove | 4.0K | Oct | 15 | 00:19 | my-blog      |
| drwxrwxr-x |   8 | inmove | inmove | 4.0K | Jul | 16 | 23:50 | redis        |
| drwxrwxr-x |   2 | inmove | inmove | 4.0K | Aug | 20 | 00:10 | sbcl         |
| drwxrwxr-x |   3 | inmove | inmove | 4.0K | Jul | 12 | 10:44 | study-pandas |

#+begin_verse
也可以是远程目录
#+end_verse
#+begin_src shell :dir /ssh:inmove@inmove.com.cn:/home/inmove/.ssh
  ls -alh
#+end_src

#+RESULTS:
| total       | 24K |        |        |      |     |    |       |                 |
| drwx------. |   2 | inmove | inmove | 76   | Oct | 22 | 14:02 | 0               |
| drwx------. |  30 | inmove | inmove | 4.0K | Oct | 23 | 19:26 | ..              |
| -rw-r--r--. |   1 | inmove | inmove | 1.5K | Nov | 25 |  2019 | authorized_keys |
| -rw-------. |   1 | inmove | inmove | 1.7K | Sep | 22 |  2017 | id_rsa          |
| -rw-r--r--. |   1 | inmove | inmove | 399  | Sep | 22 |  2017 | id_rsa.pub      |
| -rw-r--r--. |   1 | inmove | inmove | 7.3K | Oct | 22 | 14:03 | known_hosts     |

* Evaluating Code Blocks
#+begin_verse
有两种方式执行代码块
1. =#+CALL: <name>(<arguments>)=
2. =call_<name>(<arguments>)=
name就是代码在块的名字,如果在另一个文件,则 =#+CALL: file.org:clear-data()=
#+end_verse
* Cache results of evaluation
#+begin_verse
Cache适用于返回值不变的代码块.
语法为 =:cache yes=
#+end_verse

#+name: get_value
#+begin_src python :cache yes
  import random
  value = random.randint(1, 10)
  return value
#+end_src

#+RESULTS[6b58f0f67f155e4169b9ee2015582d3fcea3576e]: get_value
: 4

#+name: caller
#+begin_src python :results output :var value=get_value()
  print(value)
#+end_src

#+RESULTS[f257bf2625108d8dec735493b87e004771b71e9f]: caller
: 4
* Results of Evaluation
#+begin_verse
使用 :results 关键字来指定 code block 的返回内容
1. output: 把标准输出的内容当做返回值
2. value: 默认值.把代码块当做一个函数,使用return来指明代码块的返回值
3. vector, table
4. list
5. scalar
6. verbatim
7. file: 把结果保存在文件里面,然后插入一个链接到那个文件
#+end_verse

#+name: atable
| a | b | c |
|---+---+---|
| d | e | f |
|---+---+---|
| h | i | j |

#+begin_verse
hlines表示行与行之间是否有分割线,默认值为no
#+end_verse
#+begin_src python :var atable=atable :hlines yes
  return atable
#+end_src

#+RESULTS:
| a | b | c |
|---+---+---|
| d | e | f |
|---+---+---|
| h | i | j |

* 模板
#+begin_verse
a	‘#+BEGIN_EXPORT ascii’ … ‘#+END_EXPORT’
c	‘#+BEGIN_CENTER’ … ‘#+END_CENTER’
C	‘#+BEGIN_COMMENT’ … ‘#+END_COMMENT’
e	‘#+BEGIN_EXAMPLE’ … ‘#+END_EXAMPLE’
E	‘#+BEGIN_EXPORT’ … ‘#+END_EXPORT’
h	‘#+BEGIN_EXPORT html’ … ‘#+END_EXPORT’
l	‘#+BEGIN_EXPORT latex’ … ‘#+END_EXPORT’
q	‘#+BEGIN_QUOTE’ … ‘#+END_QUOTE’
s	‘#+BEGIN_SRC’ … ‘#+END_SRC’
v	‘#+BEGIN_VERSE’ … ‘#+END_VERSE’
#+end_verse
